# Указываем базовый образ для Node.js
FROM node:18-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем весь исходный код в контейнер
COPY . .

# Собираем проект (если используете TypeScript)
RUN npm run build

# Открываем порт 3000 (или тот, который используете в вашем приложении)
EXPOSE 5000

# Указываем команду для запуска приложения
CMD ["npm", "run", "start:prod"]
